bikeNomad/6800_Emulator/board/pin_mux.c
    gpio_pin_config_t EX_6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_EX_6_GPIO, BOARD_INITPINS_EX_6_PIN, &EX_6_config);

    gpio_pin_config_t MCU_A0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin 4)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A0_GPIO, BOARD_INITPINS_MCU_A0_PIN, &MCU_A0_config);

    gpio_pin_config_t MCU_A1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A1_GPIO, BOARD_INITPINS_MCU_A1_PIN, &MCU_A1_config);

    gpio_pin_config_t MCU_A2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 71)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A2_GPIO, BOARD_INITPINS_MCU_A2_PIN, &MCU_A2_config);

    gpio_pin_config_t MCU_A3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 70)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A3_GPIO, BOARD_INITPINS_MCU_A3_PIN, &MCU_A3_config);

    gpio_pin_config_t MCU_A4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 69)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A4_GPIO, BOARD_INITPINS_MCU_A4_PIN, &MCU_A4_config);

    gpio_pin_config_t MCU_A5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD5 (pin 33)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A5_GPIO, BOARD_INITPINS_MCU_A5_PIN, &MCU_A5_config);

    gpio_pin_config_t MCU_A6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD6 (pin 32)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A6_GPIO, BOARD_INITPINS_MCU_A6_PIN, &MCU_A6_config);

    gpio_pin_config_t MCU_A7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD7 (pin 31)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A7_GPIO, BOARD_INITPINS_MCU_A7_PIN, &MCU_A7_config);

    gpio_pin_config_t MCU_A8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD8 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A8_GPIO, BOARD_INITPINS_MCU_A8_PIN, &MCU_A8_config);

    gpio_pin_config_t MCU_A9_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD9 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A9_GPIO, BOARD_INITPINS_MCU_A9_PIN, &MCU_A9_config);

    gpio_pin_config_t MCU_A10_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD10 (pin 36)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A10_GPIO, BOARD_INITPINS_MCU_A10_PIN, &MCU_A10_config);

    gpio_pin_config_t MCU_A11_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD11 (pin 35)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A11_GPIO, BOARD_INITPINS_MCU_A11_PIN, &MCU_A11_config);

    gpio_pin_config_t MCU_A12_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin 34)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A12_GPIO, BOARD_INITPINS_MCU_A12_PIN, &MCU_A12_config);

    gpio_pin_config_t MCU_A13_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin 25)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A13_GPIO, BOARD_INITPINS_MCU_A13_PIN, &MCU_A13_config);

    gpio_pin_config_t MCU_A14_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 24)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A14_GPIO, BOARD_INITPINS_MCU_A14_PIN, &MCU_A14_config);

    gpio_pin_config_t MCU_A15_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_A15_GPIO, BOARD_INITPINS_MCU_A15_PIN, &MCU_A15_config);

    gpio_pin_config_t MCU_VMA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD16 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_VMA_GPIO, BOARD_INITPINS_MCU_VMA_PIN, &MCU_VMA_config);

    gpio_pin_config_t MCU_RW_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD17 (pin 20)  */
    GPIO_PinInit(BOARD_INITPINS_MCU_RW_GPIO, BOARD_INITPINS_MCU_RW_PIN, &MCU_RW_config);

    gpio_pin_config_t EX_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE8 (pin 26)  */
    GPIO_PinInit(BOARD_INITPINS_EX_1_GPIO, BOARD_INITPINS_EX_1_PIN, &EX_1_config);

    /* PORTA0 (pin 79) is configured as PTA0 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_NMI_PORT, BOARD_INITPINS_MCU_NMI_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA0 (pin 79): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_MCU_NMI_PORT, BOARD_INITPINS_MCU_NMI_PIN, kPORT_InterruptFallingEdge);

    /* PORTA1 (pin 78) is configured as LPUART0_RTS */
    PORT_SetPinMux(BOARD_INITPINS_UART0_RTS_PORT, BOARD_INITPINS_UART0_RTS_PIN, kPORT_MuxAlt6);

    /* PORTA10 (pin 92) is configured as noetm_Trace_SWO */
    PORT_SetPinMux(PORTA, 10U, kPORT_MuxAlt7);

    /* PORTA12 (pin 90) is configured as CAN1_RX */
    PORT_SetPinMux(BOARD_INITPINS_CAN1_RX_PORT, BOARD_INITPINS_CAN1_RX_PIN, kPORT_MuxAlt3);

