bikeNomad/6800_Emulator/board/pin_mux.c
    /* PORTA13 (pin 89) is configured as CAN1_TX */
    PORT_SetPinMux(BOARD_INITPINS_CAN1_TX_PORT, BOARD_INITPINS_CAN1_TX_PIN, kPORT_MuxAlt3);

    /* PORTA2 (pin 73) is configured as LPUART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART0_RX_PORT, BOARD_INITPINS_UART0_RX_PIN, kPORT_MuxAlt6);

    /* PORTA3 (pin 72) is configured as LPUART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART0_TX_PORT, BOARD_INITPINS_UART0_TX_PIN, kPORT_MuxAlt6);

    /* PORTA4 (pin 98) is configured as SWD_DIO */
    PORT_SetPinMux(PORTA, 4U, kPORT_MuxAlt7);

    /* PORTA5 (pin 97) is configured as RESET_b */
    PORT_SetPinMux(BOARD_INITPINS_NRESET_PORT, BOARD_INITPINS_NRESET_PIN, kPORT_MuxAlt7);

    /* PORTA6 (pin 58) is configured as PTA6 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_IRQ_PORT, BOARD_INITPINS_MCU_IRQ_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA6 (pin 58): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_MCU_IRQ_PORT, BOARD_INITPINS_MCU_IRQ_PIN, kPORT_InterruptFallingEdge);

    /* PORTA7 (pin 57) is configured as LPUART1_RTS */
    PORT_SetPinMux(BOARD_INITPINS_UART1_RTS_PORT, BOARD_INITPINS_UART1_RTS_PIN, kPORT_MuxAlt6);

    /* PORTA8 (pin 100) is configured as PTA8 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_E_PORT, BOARD_INITPINS_MCU_E_PIN, kPORT_MuxAsGpio);

    /* PORTA9 (pin 99) is configured as PTA9 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_RESET_PORT, BOARD_INITPINS_MCU_RESET_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 54) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D0_PORT, BOARD_INITPINS_MCU_D0_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 53) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D1_PORT, BOARD_INITPINS_MCU_D1_PIN, kPORT_MuxAsGpio);

    /* PORTB14 (pin 66) is configured as PTB14 */
    PORT_SetPinMux(BOARD_INITPINS_LED_1_PORT, BOARD_INITPINS_LED_1_PIN, kPORT_MuxAsGpio);

    /* PORTB15 (pin 65) is configured as PTB15 */
    PORT_SetPinMux(BOARD_INITPINS_LED_2_PORT, BOARD_INITPINS_LED_2_PIN, kPORT_MuxAsGpio);

    /* PORTB16 (pin 64) is configured as PTB16 */
    PORT_SetPinMux(BOARD_INITPINS_LED_3_PORT, BOARD_INITPINS_LED_3_PIN, kPORT_MuxAsGpio);

    /* PORTB17 (pin 63) is configured as PTB17 */
    PORT_SetPinMux(BOARD_INITPINS_LED_4_PORT, BOARD_INITPINS_LED_4_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 48) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D2_PORT, BOARD_INITPINS_MCU_D2_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 47) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D3_PORT, BOARD_INITPINS_MCU_D3_PIN, kPORT_MuxAsGpio);

    /* PORTB4 (pin 28) is configured as PTB4 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D4_PORT, BOARD_INITPINS_MCU_D4_PIN, kPORT_MuxAsGpio);

    /* PORTB5 (pin 27) is configured as PTB5 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D5_PORT, BOARD_INITPINS_MCU_D5_PIN, kPORT_MuxAsGpio);

    /* PORTB6 (pin 16) is configured as PTB6 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D6_PORT, BOARD_INITPINS_MCU_D6_PIN, kPORT_MuxAsGpio);

    /* PORTB7 (pin 15) is configured as PTB7 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_D7_PORT, BOARD_INITPINS_MCU_D7_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 40) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_EX_5_PORT, BOARD_INITPINS_EX_5_PIN, kPORT_MuxAlt2);

    /* PORTC1 (pin 39) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_EX_4_PORT, BOARD_INITPINS_EX_4_PIN, kPORT_MuxAsGpio);

    /* PORTC15 (pin 45) is configured as PTC15 */
    PORT_SetPinMux(BOARD_INITPINS_EX_8_PORT, BOARD_INITPINS_EX_8_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 44) is configured as PTC16 */
    PORT_SetPinMux(BOARD_INITPINS_EX_7_PORT, BOARD_INITPINS_EX_7_PIN, kPORT_MuxAsGpio);

    /* PORTC17 (pin 43) is configured as PTC17 */
    PORT_SetPinMux(BOARD_INITPINS_EX_6_PORT, BOARD_INITPINS_EX_6_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 30) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_EX_3_PORT, BOARD_INITPINS_EX_3_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 29) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_EX_2_PORT, BOARD_INITPINS_EX_2_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 96) is configured as SWD_CLK */
    PORT_SetPinMux(PORTC, 4U, kPORT_MuxAlt7);

    /* PORTC6 (pin 81) is configured as LPUART1_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART1_RX_PORT, BOARD_INITPINS_UART1_RX_PIN, kPORT_MuxAlt2);

    /* PORTC7 (pin 80) is configured as LPUART1_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART1_TX_PORT, BOARD_INITPINS_UART1_TX_PIN, kPORT_MuxAlt2);

    /* PORTD0 (pin 4) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A0_PORT, BOARD_INITPINS_MCU_A0_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[0] = ((PORTD->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength));

    /* PORTD1 (pin 3) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A1_PORT, BOARD_INITPINS_MCU_A1_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[1] = ((PORTD->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength));

    /* PORTD10 (pin 36) is configured as PTD10 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A10_PORT, BOARD_INITPINS_MCU_A10_PIN, kPORT_MuxAsGpio);

    /* PORTD11 (pin 35) is configured as PTD11 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A11_PORT, BOARD_INITPINS_MCU_A11_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin 34) is configured as PTD12 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A12_PORT, BOARD_INITPINS_MCU_A12_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin 25) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A13_PORT, BOARD_INITPINS_MCU_A13_PIN, kPORT_MuxAsGpio);

    /* PORTD14 (pin 24) is configured as PTD14 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A14_PORT, BOARD_INITPINS_MCU_A14_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin 22) is configured as PTD15 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A15_PORT, BOARD_INITPINS_MCU_A15_PIN, kPORT_MuxAsGpio);

    /* PORTD16 (pin 21) is configured as PTD16 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_VMA_PORT, BOARD_INITPINS_MCU_VMA_PIN, kPORT_MuxAsGpio);

    /* PORTD17 (pin 20) is configured as PTD17 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_RW_PORT, BOARD_INITPINS_MCU_RW_PIN, kPORT_MuxAsGpio);

