bikeNomad/6800_Emulator/board/pin_mux.c
    /* PORTD2 (pin 71) is configured as PTD2 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A2_PORT, BOARD_INITPINS_MCU_A2_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin 70) is configured as PTD3 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A3_PORT, BOARD_INITPINS_MCU_A3_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[3] = ((PORTD->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown));

    /* PORTD4 (pin 69) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A4_PORT, BOARD_INITPINS_MCU_A4_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 33) is configured as PTD5 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A5_PORT, BOARD_INITPINS_MCU_A5_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 32) is configured as PTD6 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A6_PORT, BOARD_INITPINS_MCU_A6_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 31) is configured as PTD7 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A7_PORT, BOARD_INITPINS_MCU_A7_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 42) is configured as PTD8 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A8_PORT, BOARD_INITPINS_MCU_A8_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin 41) is configured as PTD9 */
    PORT_SetPinMux(BOARD_INITPINS_MCU_A9_PORT, BOARD_INITPINS_MCU_A9_PIN, kPORT_MuxAsGpio);

    /* PORTE4 (pin 9) is configured as CAN0_RX */
    PORT_SetPinMux(BOARD_INITPINS_CAN0_RX_PORT, BOARD_INITPINS_CAN0_RX_PIN, kPORT_MuxAlt5);

    /* PORTE5 (pin 8) is configured as CAN0_TX */
    PORT_SetPinMux(BOARD_INITPINS_CAN0_TX_PORT, BOARD_INITPINS_CAN0_TX_PIN, kPORT_MuxAlt5);

    /* PORTE8 (pin 26) is configured as PTE8 */
    PORT_SetPinMux(BOARD_INITPINS_EX_1_PORT, BOARD_INITPINS_EX_1_PIN, kPORT_MuxAsGpio);

    /* PORTE9 (pin 23) is configured as DAC0_OUT */
    PORT_SetPinMux(BOARD_INITPINS_DAC_OUT_PORT, BOARD_INITPINS_DAC_OUT_PIN, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
